app/controllers/film_controller.rb

  def search
    @searchTerm = params[:search]
    if @searchTerm != nil
      @films = Film.search(@searchTerm)
---
SELECT `films`.* FROM `films` WHERE (title LIKE '%asdf%')

  def view
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films` WHERE `films`.`id` = 1 LIMIT 1

  def remove
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films` WHERE `films`.`id` = 4 LIMIT 1

  def edit
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films` WHERE `films`.`id` = 2 LIMIT 1

  def create
    # Instantiate a new object using form parameters
    @film = Film.new(film_params)
    # Save the object
    if params[:trivia] != nil then
      # add empty trivia associated with @film
      #@film.trivia.build
      params[:trivia].each do |triv|
        if triv.length > 0 && triv != "" && triv != nil
          @film.trivia << Trivium.new(:body=>triv, :spoiler=>false)
---
INSERT INTO `films` (`title`, `year`, `synopsis`, `created_at`, `updated_at`) VALUES ('Movie Title', 2015, 'Dingus', '2015-05-03 02:02:07.057037', '2015-05-03 02:02:07.057037')

  def update
    # Find an existing object using form parameters
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films` WHERE `films`.`id` = 2 LIMIT 1

        end
    end
    # Update the object
    if @film.update_attributes(film_params)
---
UPDATE `films` SET `year` = 2014, `synopsis` = 'Test Synopsis', `updated_at` = '2015-05-03 02:21:54.971852' WHERE `films`.`id` = 2

  def destroy
    film = Film.find(params[:id])
    film.trivia.each do |triv|
        triv.destroy
    end

    film.roles.each do |role|
        role.destroy
    end
    film.destroy
---
SELECT  `films`.* FROM `films` WHERE `films`.`id` = 4 LIMIT 1
DELETE FROM `films` WHERE `films`.`id` = 1