app/controllers/filmmaker_controller.rb

  def search
    @searchTerm = params[:search]
    if @searchTerm != nil
      @filmmakers = Filmmaker.search(@searchTerm)
---
SELECT `filmmakers`.* FROM `filmmakers`  ORDER BY filmmakers.lastName ASC

  def view
    @filmmaker = Filmmaker.find(params[:id])
---
SELECT  `filmmakers`.* FROM `filmmakers` WHERE `filmmakers`.`id` = 1 LIMIT 1

  def remove
    @filmmaker = Filmmaker.find(params[:id])
---
SELECT  `filmmakers`.* FROM `filmmakers` WHERE `filmmakers`.`id` = 1 LIMIT 1

  def edit
    @filmmaker = Filmmaker.find(params[:id])
---
SELECT  `filmmakers`.* FROM `filmmakers` WHERE `filmmakers`.`id` = 1 LIMIT 1

  def create
    # Instantiate a new object using form parameters
    @filmmaker = Filmmaker.new(filmmaker_params)
    # Save the object
    if @filmmaker.save
---
INSERT INTO `filmmakers` (`firstName`, `lastName`, `bio`, `school`, `year`, `birthDate`, `created_at`, `updated_at`) VALUES ('The Next', 'Spielberg', 'dick', 'Chaptown', 1, '2020-12-09', '2015-05-03 03:19:41.513245', '2015-05-03 03:19:41.513245')

  def destroy
    filmmaker = Filmmaker.find(params[:id]).destroy
---
DELETE FROM `filmmakers` WHERE `filmmakers`.`id` = 1
SELECT  `filmmakers`.* FROM `filmmakers` WHERE `filmmakers`.`id` = 1 LIMIT 1